barsgl/barsgl-ejbparent/barsgl-ejbtest/src/test/resources/AccountQueryProcessorTest.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
    <SOAP-ENV:Header>
        <gbo:UCBRUHeaders xmlns:gbo="urn:imb:gbo:v2">
            <gbo:Correlation>
                <gbo:XRef>PHACCOUNT2333451</gbo:XRef>
            </gbo:Correlation>
            <gbo:Audit>
                <gbo:MessagePath>
                    <gbo:Step>
                        <gbo:Application.Module>PAYMENT_HUB</gbo:Application.Module>
                        <gbo:TimeStamp>2017-01-16T12:44:52Z</gbo:TimeStamp>
                    </gbo:Step>
                </gbo:MessagePath>
                <gbo:ProcessInfo>
                    <gbo:Name>PAYMENT_HUB</gbo:Name>
                    <gbo:InstanceId>57555-888-223-69652296</gbo:InstanceId>
                </gbo:ProcessInfo>
            </gbo:Audit>
        </gbo:UCBRUHeaders>
    </SOAP-ENV:Header>
    <SOAP-ENV:Body>
        <gbo:AccountListQuery xmlns:gbo="urn:imb:gbo:v2">
            <gbo:AccountQuery>
                <gbo:CustomerNo>00692097</gbo:CustomerNo>
                <gbo:AccountSpecials>ALL</gbo:AccountSpecials>
            </gbo:AccountQuery>
            <gbo:AccountQuery>
                <gbo:CustomerNo>00597197</gbo:CustomerNo>
            </gbo:AccountQuery>
            <gbo:AccountQuery>
                <gbo:CustomerNo>00500633</gbo:CustomerNo>
            </gbo:AccountQuery>
            <gbo:AccountQuery>
                <gbo:CustomerNo>00000018</gbo:CustomerNo>
                <gbo:AccountingType>702010300</gbo:AccountingType>
                <gbo:AccountingType>758030400</gbo:AccountingType>
            </gbo:AccountQuery>
            <gbo:AccountQuery>
                <gbo:CustomerNo>911641</gbo:CustomerNo>
                <gbo:AccountSpecials>4371</gbo:AccountSpecials>
            </gbo:AccountQuery>
            <gbo:AccountQuery>
                <gbo:CustomerNo>00692097</gbo:CustomerNo>
                <gbo:AccountSpecials>1876</gbo:AccountSpecials>
            </gbo:AccountQuery>
            <gbo:AccountQuery>
                <gbo:AccountNumber>45208810200014817870</gbo:AccountNumber>			
                <gbo:AccountNumber>70601810380012620140</gbo:AccountNumber>
                <gbo:AccountNumber>40502810100011131826</gbo:AccountNumber>			
            </gbo:AccountQuery>            
            <gbo:AccountQuery>
                <gbo:AccountNumber>00000000800504735550</gbo:AccountNumber>			
            </gbo:AccountQuery>    
        </gbo:AccountListQuery>    
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>